Yoda49/PIC24E-GPIO-REMAP-DEFINES/PIC24E_gpio_remap_input.h
#ifndef __PIC24E_GPIO_REMAP_INPUT_H__
#define __PIC24E_GPIO_REMAP_INPUT_H__

// ***********************************************************
// PIN INPUT CONFIGURATION REMAP
// INPUT_PER_xxx = INPUT_PIN (RPx / RPIx)
// ***********************************************************

// ==============
// PERIPHERALS
// ==============
#define INPUT_PER_EXTERNAL_INT1 RPINR0bits.INT1R
#define INPUT_PER_EXTERNAL_INT2 RPINR1bits.INT2R
#define INPUT_PER_EXTERNAL_INT3 RPINR1bits.INT3R
#define INPUT_PER_EXTERNAL_INT4 RPINR2bits.INT4R
#define INPUT_PER_TIM2_EXT_CLK  RPINR3bits.T2CKR
#define INPUT_PER_TIM3_EXT_CLK  RPINR3bits.T3CKR
#define INPUT_PER_TIM4_EXT_CLK  RPINR4bits.T4CKR
#define INPUT_PER_TIM5_EXT_CLK  RPINR4bits.T5CKR
#define INPUT_PER_TIM6_EXT_CLK  RPINR5bits.T6CKR
#define INPUT_PER_TIM7_EXT_CLK  RPINR5bits.T7CKR
#define INPUT_PER_TIM8_EXT_CLK  RPINR6bits.T8CKR
#define INPUT_PER_TIM9_EXT_CLK  RPINR6bits.T9CKR
#define INPUT_PER_IC1           RPINR7bits.IC1R
#define INPUT_PER_IC2           RPINR7bits.IC2R
#define INPUT_PER_IC3           RPINR8bits.IC3R
#define INPUT_PER_IC4           RPINR8bits.IC4R
#define INPUT_PER_IC5           RPINR9bits.IC5R
#define INPUT_PER_IC6           RPINR9bits.IC6R
#define INPUT_PER_IC7           RPINR10bits.IC7R
#define INPUT_PER_IC8           RPINR10bits.IC8R
#define INPUT_PER_OC_FAULT_A    RPINR11bits.OCFAR
#define INPUT_PER_OC_FAULT_B    RPINR11bits.OCFBR
#define INPUT_PER_PWM_FAULT_1   RPINR12bits.FLT1R
#define INPUT_PER_PWM_FAULT_2   RPINR12bits.FLT2R
#define INPUT_PER_PWM_FAULT_3   RPINR13bits.FLT3R
#define INPUT_PER_PWM_FAULT_4   RPINR13bits.FLT4R
#define INPUT_PER_QEA1          RPINR14bits.QEA1R
#define INPUT_PER_QEB1          RPINR14bits.QEB1R
#define INPUT_PER_IND1X         RPINR15bits.IND1XR
#define INPUT_PER_HOME1         RPINR15bits.HOME1R
#define INPUT_PER_QEA2          RPINR16bits.QEA2R
#define INPUT_PER_QEB2          RPINR16bits.QEB2R
#define INPUT_PER_INDX2         RPINR17bits.INDX2R
#define INPUT_PER_HOME2         RPINR17bits.HOME2R
#define INPUT_PER_UART1_RX      RPINR18bits.U1RXR
#define INPUT_PER_UART1_CTS     RPINR18bits.U1CTSR
#define INPUT_PER_UART2_RX      RPINR19bits.U2RXR
#define INPUT_PER_UART2_CTS     RPINR19bits.U2CTSR
#define INPUT_PER_SPI1_MISO     RPINR20bits.SDI1R
#define INPUT_PER_SPI1_CLK_IN   RPINR20bits.SCK1R
#define INPUT_PER_SPI1_SS       RPINR21bits.SS1R
#define INPUT_PER_SPI2_SS       RPINR23bits.SS2R
#define INPUT_PER_DCI_DATA_IN   RPINR24bits.CSDIR
#define INPUT_PER_DCI_CLK_IN    RPINR24bits.CSCKR
#define INPUT_PER_DCI_FSYNC     RPINR25bits.COFSR
#define INPUT_PER_CAN1_RX       RPINR26bits.C1RXR
#define INPUT_PER_CAN2_RX       RPINR26bits.C2RXR
#define INPUT_PER_UART3_RX      RPINR27bits.U3RXR
#define INPUT_PER_UART3_CTS     RPINR27bits.U3CTSR
#define INPUT_PER_UART4_RX      RPINR28bits.U4RXR
#define INPUT_PER_UART4_CTS     RPINR28bits.U4CTSR
#define INPUT_PER_SPI3_MISO     RPINR29bits.SDI3R
#define INPUT_PER_SPI3_CLKIN    RPINR29bits.SCK3R
#define INPUT_PER_SPI3_SS       RPINR30bits.SS3R
#define INPUT_PER_SPI4_MISO     RPINR31bits.SDI4R
#define INPUT_PER_SPI4_CLKIN    RPINR31bits.SCK4R
#define INPUT_PER_SPI4_SS       RPINR32bits.SS4R
#define INPUT_PER_IC9           RPINR33bits.IC9R
#define INPUT_PER_IC10          RPINR33bits.IC10R
#define INPUT_PER_IC11          RPINR34bits.IC11R
#define INPUT_PER_IC12          RPINR34bits.IC12R
#define INPUT_PER_IC13          RPINR35bits.IC13R
#define INPUT_PER_IC14          RPINR35bits.IC14R
#define INPUT_PER_IC15          RPINR36bits.IC15R
#define INPUT_PER_IC16          RPINR36bits.IC16R
#define INPUT_PER_OC_FAULT_C    RPINR37bits.OCFCR
#define INPUT_PER_PWM_SYNC_IN1  RPINR37bits.SYNCI1R
#define INPUT_PER_PWM_SYNC_IN2  RPINR38bits.SYNCI2R
#define INPUT_PER_PWM_DTC_IN1   RPINR38bits.DTCMP1R
#define INPUT_PER_PWM_DTC_IN2   RPINR39bits.DTCMP2R
#define INPUT_PER_PWM_DTC_IN3   RPINR39bits.DTCMP3R
#define INPUT_PER_PWM_DTC_IN4   RPINR40bits.DTCMP4R
#define INPUT_PER_PWM_DTC_IN5   RPINR40bits.DTCMP5R
#define INPUT_PER_PWM_DTC_IN6   RPINR41bits.DTCMP6R
#define INPUT_PER_PWM_DTC_IN7   RPINR41bits.DTCMP7R
#define INPUT_PER_PWM_FAULT_5   RPINR42bits.FLT5R
#define INPUT_PER_PWM_FAULT_6   RPINR42bits.FLT6R
#define INPUT_PER_PWM_FAULT_7   RPINR43bits.FLT7R




// ==============
// PINS
// ==============
#define INPUT_PIN_RPI16  0b0010000
#define INPUT_PIN_RPI17  0b0010001
#define INPUT_PIN_RPI18  0b0010010
#define INPUT_PIN_RPI19  0b0010011
#define INPUT_PIN_RPI20  0b0010100
#define INPUT_PIN_RPI21  0b0010101
#define INPUT_PIN_RPI22  0b0010110
#define INPUT_PIN_RPI23  0b0010111
#define INPUT_PIN_RPI30  0b0011110
#define INPUT_PIN_RPI31  0b0011111
#define INPUT_PIN_RPI32  0b0100000
#define INPUT_PIN_RPI33  0b0100001
#define INPUT_PIN_RPI34  0b0100010
#define INPUT_PIN_RPI35  0b0100011
#define INPUT_PIN_RPI36  0b0100100
#define INPUT_PIN_RPI37  0b0100101
#define INPUT_PIN_RPI38  0b0100110
#define INPUT_PIN_RPI39  0b0100111
#define INPUT_PIN_RPI40  0b0101000
#define INPUT_PIN_RPI41  0b0101001
#define INPUT_PIN_RPI42  0b0101010
#define INPUT_PIN_RPI43  0b0101011
#define INPUT_PIN_RPI44  0b0101100
#define INPUT_PIN_RPI45  0b0101101
#define INPUT_PIN_RPI46  0b0101110
#define INPUT_PIN_RPI47  0b0101111
#define INPUT_PIN_RPI49  0b0110001
#define INPUT_PIN_RPI50  0b0110010
#define INPUT_PIN_RPI51  0b0110011
#define INPUT_PIN_RPI52  0b0110100
#define INPUT_PIN_RPI60  0b0111100
#define INPUT_PIN_RPI61  0b0111101
#define INPUT_PIN_RPI62  0b0111110
#define INPUT_PIN_RP64   0b1000000
#define INPUT_PIN_RP65   0b1000001
#define INPUT_PIN_RP66   0b1000010
#define INPUT_PIN_RP67   0b1000011
#define INPUT_PIN_RP68   0b1000100
#define INPUT_PIN_RP69   0b1000101
#define INPUT_PIN_RP70   0b1000110
#define INPUT_PIN_RP71   0b1000111
#define INPUT_PIN_RPI72  0b1001000
#define INPUT_PIN_RPI73  0b1001001
#define INPUT_PIN_RPI74  0b1001010
#define INPUT_PIN_RPI75  0b1001011
#define INPUT_PIN_RPI76  0b1001100
#define INPUT_PIN_RPI77  0b1001101
#define INPUT_PIN_RPI78  0b1001110
#define INPUT_PIN_RP79   0b1001111
#define INPUT_PIN_RP80   0b1010000
#define INPUT_PIN_RPI81  0b1010001
#define INPUT_PIN_RP82   0b1010010
#define INPUT_PIN_RPI83  0b1010011
#define INPUT_PIN_RP84   0b1010100
#define INPUT_PIN_RP85   0b1010101
#define INPUT_PIN_RPI86  0b1010110
#define INPUT_PIN_RP87   0b1010111
#define INPUT_PIN_RPI88  0b1011000
#define INPUT_PIN_RPI89  0b1011001
#define INPUT_PIN_RP96   0b1100000
#define INPUT_PIN_RP97   0b1100001
#define INPUT_PIN_RP98   0b1100010
#define INPUT_PIN_RP99   0b1100011
#define INPUT_PIN_RP100  0b1100100
#define INPUT_PIN_RP101  0b1100101
#define INPUT_PIN_RP102  0b1100110
#define INPUT_PIN_RP104  0b1101000
#define INPUT_PIN_RP108  0b1101100
#define INPUT_PIN_RP109  0b1101101
#define INPUT_PIN_RP112  0b1110000
#define INPUT_PIN_RP113  0b1110001
#define INPUT_PIN_RP118  0b1110110
#define INPUT_PIN_RPI119 0b1110111
#define INPUT_PIN_RP120  0b1111000
#define INPUT_PIN_RPI121 0b1111001
#define INPUT_PIN_RPI124 0b1111100
#define INPUT_PIN_RP125  0b1111101
#define INPUT_PIN_RP126  0b1111110
#define INPUT_PIN_RP127  0b1111111

#endif

